app/controllers/home_controller.rb

SELECT "articles".* FROM "articles" WHERE (section='pe') AND (draft='t') ORDER BY published_at DESC
---
  def index
    @first_article = Article.where('section=?', :po).first

SELECT "articles".* FROM "articles" WHERE (section='co') AND (draft='t') ORDER BY published_at DESC
---
  def comercial
    @articles = Article.where('section=?', :co).order('published_at DESC')